<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<html>
  <head>
    <title></title>
    
    <link rel="stylesheet" type="text/css" href="styles/locale.css" media="screen" />
    
    <script src="https://ajax.googleapis.com/ajax/libs/jquery/3.1.1/jquery.min.js"></script>
    <script src="/scripts/js.cookie.js"></script>
    <script src="/scripts/locale.js"></script>
  </head>
  
  <body onload="setLocaleOnLoad()">

    <a href="#" onclick="setLocale('no');"><img src="/images/no.png" alt="Norsk språk"></a>
    <a href="#" onclick="setLocale('en');"><img src="/images/gb.png" alt="English"></a>

    <h1>
      <div class="localeNo">
        En annen side p&aring; norsk
      </div> 
      <div class="localeEn hiddenLocale">
        Another page in English
      </div>
    </h1>
    <div class="localeNo">
      <p>
        Språkvalg lagres som en cookie, og browseren vil huske hvilket sprøk brukere har valgt når de går fra en side til en annen.
      </p>
    </div> 
    <div class="localeEn">
      <p>
        Selected language is stored in a cookie, so that the browser keep track of language preferences when the user navigates between site pages.
      </p>
    </div> 
    <div class="localeNo">
      <p>
        Da n&aring; skrubben hadde ett opp hesten, tok Askeladden bikselet og bandt i kjeften p&aring; den, og salen og la p&aring; ryggen av den, og n&aring; var skrubben blitt s&aring; sterk av det den hadde f&aring;tt i seg, at den satte avsted med kongss&oslash;nnen som ingen ting; s&aring; fort hadde han aldri ridd f&oslash;r.
      </p>
    </div> 
    <div class="localeEn">
      <p>
        The bedding was hardly able to cover it and seemed ready to slide off any moment. His many legs, pitifully thin compared with the size of the rest of him, waved about helplessly as he looked. "What's happened to me? " he thought. It wasn't a dream.
      </p>
    </div> 
    <div class="localeNo">
      <p>
        Men s&aring; var det den gongen je ville tala om, som je s&aring;g &#x27;n. Je var nettopp vaksen, for det var &aring;ret etter je hadde g&aring;tt for presten; det var en l&oslash;rdagsefta, je hadde v&oslash;ri i byen med planker, og v&oslash;ri p&aring; en liten kant om dagen. Straks je kom him, gikk je sta og la meg. Da det lei utp&aring; kvelden, sto je opp, og da je hadde f&aring;tt i meg litt mat - mye var det inte, for je var &oslash;r og lei i hue enn&aring; - s&aring; sa &#x27;n far til meg: &quot;F&oslash;r du g&aring;r bort og legger deg igjen, f&aring;r du gi Blakken nattef&ocirc;ret du, for de andre er vel ute og renner etter jentene igjen.&quot;
      </p>
    </div> 
    <div class="localeEn">
      <p>
        His room, a proper human room although a little too small, lay peacefully between its four familiar walls. A collection of textile samples lay spread out on the table - Samsa was a travelling salesman - and above it there hung a picture that he had recently cut out of an illustrated magazine and housed in a nice, gilded frame. It showed a lady fitted out with a fur hat and fur boa who sat upright, raising a heavy fur muff that covered the whole of her lower arm towards the viewer. Gregor then turned to look out the window at the dull weather. Drops.
      </p>
    </div>
    <div class="localeNo">
      <p>
        <a href='/'>Tilbake til forsiden</a>
      </p>
    </div> 
    <div class="localeEn">
      <p>
        <a href='/'>Back to front page</a>
      </p>
    </div>
    <p>
      Flag icons by <a href='http://www.icondrawer.com'>www.icondrawer.com</a>.
    </p>

  </body>
</html>
